### 5장 실습 1

In [52]:
import numpy as np
import pandas as pd

names_1=['Hisila', 'Brian','Zeppy']
salary_1=[23,30,21]

names_2=['Ram','Shyam',"Hari"]
salary_2=[22,23,31]

df_1 = pd.DataFrame({'Name': names_1, 'Salary': salary_1})
df_2 = pd.DataFrame({'Name': names_2, 'Salary': salary_2})

In [53]:
df_1

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21

In [54]:
df_2

    Name  Salary
0    Ram      22
1  Shyam      23
2   Hari      31

In [55]:
merged_df = pd.concat([df_1, df_2])
merged_df

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21
0     Ram      22
1   Shyam      23
2    Hari      31

In [56]:
merged_df.drop([1])

     Name  Salary
0  Hisila      23
2   Zeppy      21
0     Ram      22
2    Hari      31

In [57]:
merged_df.drop(['Name'], axis=1)

   Salary
0      23
1      30
2      21
0      22
1      23
2      31

In [58]:
df = pd.DataFrame({'A':[7,1,5,4,2,1,4,4,8],'B':[1,2,8,5,3,4,2,6,8]})
df['A'].unique()

array([7, 1, 5, 4, 2, 8], dtype=int64)

In [1]:
import numpy as np
import pandas as pd

fruits = pd.DataFrame({'name':['apple','mango','banana','cherry'],

                    'price':[2000,150,500,400],

                    'qty':[5,4,10, np.NaN]})

In [2]:
fruits

     name  price   qty
0   apple   2000   5.0
1   mango    150   4.0
2  banana    500  10.0
3  cherry    400   NaN

In [3]:
fruits.dtypes

name      object
price      int64
qty      float64
dtype: object

In [5]:
fruits.index = fruits['name']
fruits

          name  price   qty
name
apple    apple   2000   5.0
mango    mango    150   4.0
banana  banana    500  10.0
cherry  cherry    400   NaN

In [95]:
fruits.iloc[:,1:3]

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

In [96]:
fruits = fruits.iloc[:,1:3]
fruits

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

### 1) qty의 평균

In [65]:
fruits['qty'].mean()

6.333333333333333

### 2) price가 1000 이상인 과일 이름 출력

In [66]:
fruits[fruits['price']>=1000] # 이름만 출력해야하나 ..

       price  qty
name
apple   2000  5.0

### 3) cherry, banana, mango, apple 순 출력

In [97]:
fruits2 = fruits.reindex(['cherry', 'banana', 'mango', 'apple'])
fruits2

        price   qty
name
cherry    400   NaN
banana    500  10.0
mango     150   4.0
apple    2000   5.0

### 4) 세 번째 row에 추가 peach 추가 (price : 2500, qty : 3)

In [98]:
fruits.reindex(['cherry', 'banana', 'peach','mango' ,'apple'])
# fruits.loc['peach'] = [2500,3]  # 이건 왜 peach 가 밑에 내ㄹ려가는지 모르겠네
fruits

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

### 5) qty -> QTY 수정